{
  "hero-statement": "Craft solid and scalable frontend products with great user experiences.",
  "open-source-contributor": "Open Source Contributor",
  "linkedin": "LinkedIn",
  "resume": "Resume",
  "employment": "Employment",
  "senior-frontend-engineer": "Senior Front-end Engineer",
  "senior-engineer": "Senior Engineer",
  "software-consultant": "Software Consultant",
  "engineer": "Engineer",
  "senior-engineer": "Senior Engineer",
  "remote": "{company}, remote",
  "experience": "Experience",
  "education": "Education",
  "location": "Location",
  "kaohsiung-taiwan": "Kaohsiung, Taiwan",
  "major": "Bachelor of Computer Science and Information Engineering",
  "university": "Shu-Te University, Kaohsiung, Taiwan",
  "proven-records": "Proven Records",
  "rocket-1": "Improved the efficiency of the stockholders' daily workflows drastically.",
  "rocket-2": "Reviewed the front-end architecture and suggested insightful action plans.",
  "rocket-3": "Designed and shipped an admin interface for ecommerce merchants.",
  "rocket-4": "Developed foundational JavaScript UI component libraries for shipping new features faster.",
  "rocket-5": "Crafted a Rails-friendly server-side rendering shopping site with airbnb's Hypernova to improve SEO rankings.",
  "rocket-6": "Rewrote the whole admin codebase with Vue.js from the previous CoffeeScript one.",
  "moxa2-1": "Engineered the admin interface of IOT product for device data monitoring.",
  "moxa2-2": "Reviewed and suggested action plans for bringing the UX culture to the company.",
  "moxa3-3": "Worked closely with UI designer and product manager to brainstorm the IOT product with UX in mind.",
  "dt-1": "Developed web educational materials to inspire mentees.",
  "dt-2": "Recruited talented engineers to maintain projects.",
  "dt-3": "Managed outsourcing contracts to ensure company projects were finished on time.",
  "dt-4": "Worked with other engineers to create better products.",
  "dt-5": "Embraced the remote-first culture and adapted asynchronous, proactive communication.",
  "moxa-1": "Brainstormed the IOT product with a product manager for clients.",
  "moxa-2": "Created an admin interface of the IOT product with AngularJS.",
  "pixnet-1": "Developed and shipped an ecommerce site with PHP.",
  "pixnet-2": "Created an album uploader with VanillaJS.",
  "pixnet-3": "Involved in the DevOps process with daily deployments.",
  "landing-official": "Landing Official",
  "portfolio": "Portfolio",
  "landing-official-desc": "The official landing website that introduces basic functions,\nsuccessful cases and pricing plans to interested merchants.\nIt allows them to apply for selling products online.",
   "view-site": "看 Demo",
   "landing-desc": "One page shopping website, a perfect entry into ecommerce.\nIt's fully responsible, let customers select products and pay on one web page.",
   "landing": "Landing ( One Page Shop )",
   "beyond": "Beyond",
   "beyond-desc": "Foundational JavaScript UI components library.",
   "adarsha": "ADARSHA",
   "adarsha-desc": "A web app that lets users read and conduct searches of ancient documents in a digital format.",
   "ketaka-lite": "KETAKA Lite",
   "ketaka-lite-desc": "A standalone application that enables file format conversion and file import and has a built-in simple editor allowing users edit their imported data.",
   "pixnet-article": "PIXNET New Type Article",
   "pixnet-article-desc": "PIXNET's new article page for ecommerce blogging.",
   "ending-quote": "Finally you are here ! Thank you for viewing my portfolio.",
   "hire-dax": "HIRE DAX"
}
